[
    {
    "id": 1,
    "imgUrl": "/abilities_logo/react_logo.svg",
    "name": "React",
    "description": "React est une bibliothèque JavaScript développée par Meta pour créer efficacement des interfaces utilisateur interactives basées sur des composants.",
    "precentProgress": 80
    },
    {
    "id": 2,
    "imgUrl": "/abilities_logo/html_logo.svg",
    "name": "HTML 5",
    "description": "HTML5 est le langage standard pour structurer le contenu web. Il introduit des balises sémantiques, la vidéo, l’audio et améliore l’accessibilité.",
    "precentProgress": 90
    },
    {
    "id": 3,
    "imgUrl": "/abilities_logo/css_logo.svg",
    "name": "CSS 3",
    "description": "CSS3 permet de styliser les pages web avec des animations, des transitions et des mises en page avancées comme Flexbox ou Grid.",
    "precentProgress": 90
    },
    {
    "id": 4,
    "imgUrl": "/abilities_logo/javascript_logo.svg",
    "name": "Javascript",
    "description": " JavaScript est un langage de programmation qui rend les pages web interactives : animations, formulaires dynamiques, mises à jour sans recharger.",
    "precentProgress": 80
    },
    {
    "id": 5,
    "imgUrl": "/abilities_logo/nodejs_logo.svg",
    "name": "Node.js",
    "description": "Node.js est un environnement d’exécution JavaScript côté serveur, basé sur V8, idéal pour les applications web rapides et évolutives.",
    "precentProgress": 60
    },
    {
    "id": 6,
    "imgUrl": "/abilities_logo/expressjs_logo.svg",
    "name": "Express.js",
    "description": "EExpress.js est un framework minimaliste pour Node.js, conçu pour créer rapidement des API et des applications web.",
    "precentProgress": 70
    },
    {
    "id": 7,
    "imgUrl": "/abilities_logo/ror_logo.svg",
    "name": "Ruby on Rails",
    "description": "Ruby on Rails est un framework web basé sur Ruby, suivant le principe convention over configuration pour un développement rapide.",
    "precentProgress": 20
    },
    {
    "id": 8,
    "imgUrl": "/abilities_logo/nestjs_logo.svg",
    "name": "NestJs",
    "description": "NestJS est un framework Node.js structuré, inspiré d’Angular, facilitant le développement d’API robustes en TypeScript.",
    "precentProgress": 10
    },
    {
    "id": 9,
    "imgUrl": "/abilities_logo/git_logo.svg",
    "name": "Git",
    "description": "Git est un système de contrôle de version distribué, permettant de suivre et de gérer les modifications du code source.",
    "precentProgress": 75
    },
    {
    "id": 10,
    "imgUrl": "/abilities_logo/github_logo.svg",
    "name": "GitHub",
    "description": "GitHub est une plateforme collaborative basée sur Git, utilisée pour héberger, partager et versionner du code en ligne.",
    "precentProgress": 75
    },
    {
    "id": 11,
    "imgUrl": "/abilities_logo/vscode_logo.svg",
    "name": "Visual Studio Code",
    "description": "VS Code est un éditeur de code léger, extensible et multiplateforme, idéal pour le développement web et supportant de nombreux langages.",
    "precentProgress": 75
    },
    {
    "id": 12,
    "imgUrl": "/abilities_logo/typescript_logo.svg",
    "name": "TypeScript",
    "description": "TypeScript est un surensemble de JavaScript ajoutant des types statiques, facilitant la maintenance, la lisibilité et la détection d’erreurs à la compilation.",
    "precentProgress": 70
    },
    {
    "id": 13,
    "imgUrl": "/abilities_logo/postgre_logo.svg",
    "name": "PostGreSQL",
    "description": "PostgreSQL est un système de base de données relationnelle open source, puissant, fiable, et conforme aux standards SQL.",
    "precentProgress": 60
    },
    {
    "id": 14,
    "imgUrl": "/abilities_logo/mysql_logo.svg",
    "name": "MySQL",
    "description": "MySQL est un système de gestion de base de données relationnelle très répandu, utilisé pour des applications web simples à complexes.",
    "precentProgress": 60
    },
    {
    "id": 15,
    "imgUrl": "/abilities_logo/mongodb_logo.svg",
    "name": "MongoDB",
    "description": "MongoDB est une base de données NoSQL orientée documents, flexible, idéale pour les données non structurées et les applications évolutives.",
    "precentProgress": 50
    },
    {
    "id": 16,
    "imgUrl": "/abilities_logo/nextjs_logo.svg",
    "name": "Next.js",
    "description": "Next.js est un framework React pour le développement web full-stack, avec rendu côté serveur (SSR) et génération statique (SSG).",
    "precentProgress": 20
    },
    {
    "id": 17,
    "imgUrl": "/abilities_logo/apple_logo.svg",
    "name": "MacOS",
    "description": "MacOS est le système d’exploitation développé par Apple pour ses ordinateurs, connu pour sa stabilité, sa sécurité et son interface intuitive.",
    "precentProgress": 50
    },
    {
    "id": 18,
    "imgUrl": "/abilities_logo/windows_logo.svg",
    "name": "Windows",
    "description": "Windows est un système d’exploitation développé par Microsoft, largement utilisé dans les environnements personnels, professionnels et éducatifs.",
    "precentProgress": 60
    },
    {
    "id": 19,
    "imgUrl": "/abilities_logo/sass_logo.svg",
    "name": "Sass",
    "description": "Sass est un préprocesseur CSS qui permet l’utilisation de variables, boucles et fonctions pour écrire du code plus maintenable.",
    "precentProgress": 80
    },
    {
    "id": 20,
    "imgUrl": "/abilities_logo/postman_logo.svg",
    "name": "Postman",
    "description": "Postman est un outil de test d’API qui facilite les requêtes HTTP, la documentation et l’automatisation des tests.",
    "precentProgress": 40
    },
    {
    "id": 21,
    "imgUrl": "/abilities_logo/protools_logo.svg",
    "name": "Pro Tools",
    "description": "Pro Tools est un logiciel professionnel de production audio, utilisé dans les studios pour l’enregistrement, l’édition et le mixage avancé.",
    "precentProgress": 95
    }
]