[
    {
        "id": 1,
        "name": "Site web d'une architecte d'intérieur",
        "codeUrl": "https://github.com/Francis-Berrier/Site-Sophie-Bluel.git",
        "codeImgUrl": "/pic_projets/bluel_capture.webp",
        "description": "Dans le cadre d'un exercice pour développer le frontend d'un site en HTML, JS, et CSS sans bibliothèque ou framework, j'ai choisi de structurer selon une architecture MVC en JS exclusif pour générer un site One Page en rendu client. A noter que le backend n'est pas codé par mes soins",
        "langages": ["HTML", "CSS", "JavaScript"]
    },
    {
        "id": 2,
        "name": "Site agence immobiliere Kasa",
        "codeUrl": "https://github.com/Francis-Berrier/kasa.git",
        "codeImgUrl": "/pic_projets/kasa_capture.webp",
        "description": "La demande était de développer le frontend du site conformément à une maquette fournie en React. Dans ce projet, j'ai en outre apporté une gestion des erreurs centralisée et une gestion du contenu séparé pour le rendre prêt à une éventuelle traduction.",
        "langages": ["React", "Sass"]
    },
    {
        "id": 3,
        "name": "Backend d'un site de notation de livres",
        "codeUrl": "https://github.com/Francis-Berrier/VieuxGrimoireBackend.git",
        "codeImgUrl": "/pic_projets/grimoire_capture.webp",
        "description": "Pour ce projet, il nous était demandé de développer le backend d'un site de notation de livres grâce à Node.js, express et une base de données MongoDb. Pour ce projet, je me suis attaché à le rendre proche d'un état production, dans la logique modulaire et la sécurité. J'ai par ailleurs implanté un monitoring des erreurs via un journal de logs. En plus, afin de parfaire mon apprentissage, j'ai choisi de développer sur une autre branche Git une version fonctionnant avec PostGreSql et prisma.",
        "langages": ["Node.Js", "Express.js", "MongoDB", "PostGreSQL"]
    },
    {
        "id": 4,
        "name": "Portfolio Francis Berrier",
        "codeUrl": "https://github.com/Francis-Berrier/PortFolio.git",
        "codeImgUrl": "/pic_projets/portfolio_capture.webp",
        "description": "Portfolio présentant mon parcours et mes capacités ",
        "langages": ["React", "TypeScript", "Sass", "Next.Js"]
    },
    {
        "id": 5,
        "name": "En Projet: Application de gestion de tournois de tennis de table",
        "codeUrl": "",
        "codeImgUrl": "/pic_projets/tt_capture.webp",
        "description": "Application de bureau visant à améliorer la gestion des tournois de tennis de tables au sein des clubs, pour optimiser la saisie des résultats et le dispatch des tables pour les organisateurs et améliorer la visibilité du déroulement pour les joueurs",
        "langages": ["React", "TypeScript", "Sass", "Next.Js", "Node.Js", "Express.js", "SQLite", "Electron"]
    }
]